;Inno Setup XDELTA Patch Language file v1.3 for ISXPM 2.4.0.0
;Language: French
;Author: Fabriceunko

[ISPATCH]
;Buttons
START_BUTTON='Lancer'
BROWSE_BUTTON='Parcourir'
INFO_BUTTON='Info'
EXIT_BUTTON='Quitter'
BACKUP_BUTTON='Enregistrer la sauvegarde'
LOG_BUTTON='Enregistrer le journal'
MUSIC_BUTTON_PLAY='Musique'
MUSIC_BUTTON_PAUSE='Musique'
VERIFY_BUTTON='Vérifier le hachage'
CLOSE_BUTTON='Fermer'

;Logs
ROLLBACK_STARTED='La restauration a commencé!'
ROLLBACK_END='Restauration appliquée en raison d'une erreur.'

FAILED_TO_ROLLBACK='[!]  Erreur : Échec de la restauration à partir de: '
FAILED_TO_ROLLBACK2=' fichier à: '


ROLLBACK_SUCCESS2=' à: '
ROLLBACK_SUCCESS3=' Succès.'

FAILED_TO_DELETE_INCLUDED='[!]  Erreur : Échec de la suppression incluse: '

INCLUDED_DELETED_SUCCESS2=' supprimé avec succès.'

INCLUDED_DIR_DELETED2=' est vide et a été supprimé avec succès.'

BACKUP_DIR_DELETED2=' A été supprimée.'

BACKUP_DIR_DELETED_NOT_FULLY2=' effacé à l'exception de certains fichiers ou dossiers actuellement utilisés. Vérifiez ce répertoire pour plus de détails.'

ROLLBACK_FINISHED='Restauration terminée!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Correction terminée avec des erreurs!'

EXTRACT_TEMP_PATCH_DATA='Extraction des données de patch dans un répertoire temporaire...'

START_PATCHING='[Démarrage de la session de patch]'

TARGET_FILE='--> Fichier cible: '
PATCH_DATA_FILE='=> Fichier de données de patch: '
OUTPUT_PATCHED='>> Sortie patchée: '

ERROR_DELETING_OLD_FILE='[!]  Une erreur s'est produite lors de la suppression d'un ancien fichier ! Peut-être est-il utilisé par un autre programme?'

NOT_EXISTS_OR_MISSMATCH='[!]  Erreur : dans le répertoire choisi, les fichiers requis pour le patch n'existent pas ou ne correspondent pas au hachage attendu.'
CORRECT_PROBLEM='[!]  Corrigez ce problème, puis essayez à nouveau d'appliquer le correctif.'

PATCHING_END='[Fin de la session de patch]'
COPYING_START='[Démarrage de la session de copie]'

COPY_FAILED='[!]  Erreur : Échec de la copie du fichier inclus: '
COPY_FAILED2=' à:'

COPY_IN_USE='Peut-être '
COPY_IN_USE2=' est en cours d'utilisation!'

INCLUDED_COPYIED2=' est copié dans: '

COPYING_END='[Copie de fin de session]'

TEMP_ROLLBACK_DELETED_IN_USE2=' a été effacé mais impossible de supprimer certains fichiers et/ou dossiers utilisés. Vérifiez ce répertoire pour plus de détails.'

EXTERNAL_COPYIED='Des fichiers externes supplémentaires ont été copiés dans: '

STORED_BACKUP='Fichiers de sauvegarde stockés dans: '

OPERATION_SUCCESS='Operation complétée avec succès!'

;Checks
FIND_BY_WINDOW_NAME='L application cible est en cours d exécution!'
FIND_BY_WINDOW_NAME2='Veuillez le fermer '
FIND_BY_WINDOW_NAME3=' puis exécutez à nouveau le patch!'

FIND_BY_CLASS_NAME='L application cible est en cours d'exécution'
FIND_BY_CLASS_NAME2='Veuillez le fermer '
FIND_BY_CLASS_NAME3=' puis exécutez à nouveau le patch!'

FIND_BY_MUTEX='L application cible est en cours d exécution'
FIND_BY_MUTEX2='Veuillez le fermer '
FIND_BY_MUTEX3=' puis exécutez à nouveau le patch!'

FIND_BY_PROC='L application cible est en cours d exécution'
FIND_BY_PROC2='Veuillez le fermer '
FIND_BY_PROC3=' puis exécutez à nouveau le patch!'

;Errors
ORIGINAL_NOT_FOUND='Impossible de trouver l'application dans le répertoire choisi!'

ROLLBACK_ERROR='Restauration appliquée en raison d'erreurs de correctif.'
ROLLBACK_ERROR2='La restauration des fichiers modifiés est terminée. Tous les nouveaux fichiers ont été supprimés.'
ROLLBACK_ERROR3='Supprimer le répertoire de sauvegarde: '
ROLLBACK_ERROR4='complètement avec tous les fichiers et sous-répertoires inclus?'

INCORRECR_PATH_ENTERED='Répertoire invalide! Veuillez sélectionner le répertoire d'applications!'

NOTHING_TO_PATCH='Erreur! Le répertoire choisi n'a pas les fichiers requis pour le patch!'
NOTHING_TO_PATCH2='Veuillez vérifier les fichiers d'origine et les noms de fichiers dans le répertoire sélectionné!'
NOTHING_TO_PATCH3='Rien à patcher!'
FINISHED_WITH_ERRORS='Patching fini avec des erreurs ! Consultez le journal pour plus de détails!'
PATCH_UNSUCCESS='[!]  Des erreurs se sont produites lors du patch!'

;Informations
BROWSE_DIALOG='Veuillez sélectionner un répertoire où réside l'application:'

PATCHING_PROCESS='Patching en cours, veuillez patienter...'
PATCH_APPLIED='Fait!'
PATCHING='Patcher: '
PATCHING_ERROR='Le correctif n'a pas été appliqué!'
PATCHING_PREPARING='Préparation du patch...'
COPYING_PROCESS='Processus de copie, veuillez patienter...'
COPYING_EXTERNAL='Copier des fichiers externes...'
FORM_CLOSED='La fenêtre du patch se fermera automatiquement après '
FORM_CLOSED2=' secondes.'

;new 0.8
DELETING_JUNKED='[Suppression des fichiers inutiles]'
COMPLETING_JUNKED='[Terminé la suppression des fichiers inutiles]'
JUNKED_REMOVED='--> Fichier indésirable supprimé: '
JUNKED_REM_FAILED='[!]  Échec de la suppression du fichier indésirable: '
FAILED_TO_RESTORE='[!]  Erreur : Échec de la restauration du fichier indésirable à partir de: '
FAILED_TO_RESTORE2=' à: '
JUNKED_RESTORED='Fichier indésirable: '
JUNKED_RESTORED2=' est restauré avec succès.'

;new 0.9
;ALLREADY_UPDATED='Application déjà mise à jour!'


; Language update 0.9a for ISXPM 2.0.0.0 beta 1
INCORRECT_HASH='Non-concordance de hachage de fichier!'
INCORRECT_HASH2='Veuillez vérifier la version de votre programme!'
INVALID_HASH='[!]  Erreur! Hachage invalide pour: '
VALID_HASH='OK! Hachage valide pour: '

SET_ATTRIBUTES='Définir les attributs des fichiers...'
SET_ATTRIBUTES_FAILED='[!]  Impossible de définir les attributs d'origine sur le fichier: '
SET_ATTRIBUTES_SUCCESS='Les attributs du fichier ont été définis avec succès!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Certains attributs n'ont pas été définis!'
 
HANDLE_ERROR='[!]  Une erreur critique s'est produite lors de l'accès à: '
 
GET_TIME_FAILED='[!]  Impossible d'obtenir les attributs d'heure du fichier: '
SET_TIME_FAILED='[!]  Échec de la définition des attributs d'heure dans le fichier: '

VERIFICATION_START='Démarrage du processus de vérification...'
VERIFICATION_FINISH='Processus de vérification terminé ! Aucune incompatibilité de hachage détectée!'

PREPARING_TO_OPERATIONS='Préparation des opérations suivantes, attente du déchargement du moteur de correctifs...'

FORCE_PATCHING='Patcher en mode forcé!'
FORCE_PATCHING2='Seuls les fichiers requis existants seront mis à jour et tout le reste sera ignoré...'

COPYING_EXTERNAL_FILE='--> Copie du fichier vers: '
COPYING_EXTERNAL_FILE_FAILED='[!]  Une erreur s'est produite lors de la copie du fichier: '

EXTRACTING_PROCESS='Extraction de données externes...'
EXTRACTING_EXTERNAL_FILE='--> Extraction de données vers: '
EXTERNAL_EXTRACTED='Des données externes supplémentaires ont été extraites pour: '
EXTRACTING_START='Processus d'extraction, veuillez patienter...'

EXTRACTING_ERROR='[!]  La décompression a échoué ! Peut-être que l'archive est corrompue ou qu'il n'y a pas assez d'espace libre!'
EXTRACTING_ERROR2='Échec de l'extraction de l'archive!'
EXTRACTING_ERROR3='Peut-être que l'archive est corrompue ou qu'il n'y a pas assez d'espace libre?'
EXTRACTING_WITH_ERRORS='L'extraction de l'archive s'est terminée avec des erreurs ! Consultez le journal pour plus de détails!'

DOWNLOAD_REQUIRED='Ce patch nécessite de télécharger certaines données depuis un serveur!'
DOWNLOAD_FAILED='[!]  Impossible de continuer le processus de correction sans les données requises!'
DOWNLOAD_FAILED2='Veuillez fournir une connexion au serveur, puis réessayer!'

DOWNLOAD_MIRROR='Échec du téléchargement des données depuis le serveur principal ! Essayer de télécharger depuis un miroir...'
DOWNLOAD_START='Téléchargement de données: '
DOWNLOAD_START2='à: '
DOWNLOAD_START3='Taille totale: '

READ_OK='Données téléchargées avec succès!'
CONNECT_ERROR_NETWORK='[!]  Erreur : Il n'y a pas de connexion Internet ou une éventuelle connexion Internet n'est pas active.'
CONNECT_ERROR_OFFLINE='[!]  Erreur : L'ordinateur est en mode hors connexion.'
CONNECT_ERROR_INITIALIZE='[!]  Erreur : Échec de l'initialisation du package d'installation pour accéder à Internet.'
CONNECT_ERROR_OPENSESSION='[!]  Erreur : Échec de l'ouverture de la session FTP ou HTTP.'
CONNECT_ERROR_CREATEREQUEST='[!]  Erreur : Échec de la création d'un descripteur de requête HTTP.'
CONNECT_ERROR_SENDREQUEST='[!]  Erreur : Échec de l'envoi de la requête au serveur HTTP.'
READ_ERROR_DELETEFILE='[!]  Erreur : le fichier local existe, mais n'a pas pu le supprimer.'
READ_ERROR_SAVEFILE='[!]  Erreur : Échec de l'enregistrement des données dans le fichier local.'
READ_ERROR_CANCELED='[!]  Erreur : téléchargement annulé par l'utilisateur.'
READ_ERROR_READDATA='[!]  Erreur : Échec de la lecture des données à partir de l'URL distante.'
UNKNOWN_ERROR='[!]  Erreur inconnue : le code d'état HTTP est: '

CANCEL_DOWNLOAD_BUTTON='Annuler le téléchargement'

;old corrected
TOTAL_PATCHED_FILES='Montant total des dossiers traités: '
PATCHING_LOG='Journal de patch enregistré dans: '
INCLUDED_COPYIED='--> Fichier inclus: '
TEMP_ROLLBACK_DELETED='Les fichiers temporaires pour la restauration ont été supprimés dans: '
DIRECT_PATCH_DATA='Accès direct aux données de patch...'

;Strings
DESCRIPTION='Description:'
COPYRIGHT='Copyright:'
CONTACT='Contact:'
INSTALLATION='Installer dans:'

;no more used this strings from previous old translation versions
;INCORRECT_MD5='Le hachage MD5 ne provient pas du fichier d'origine!'
;INCORRECT_MD52='Veuillez vérifier la version de votre programme!'
;INVALID_HASH='[!]  Hachage MD5 non valide pour le fichier mis à jour: '
;VALID_HASH='Hachage MD5 valide pour le fichier mis à jour: '
;TEMP_ROLLBACK_DELETED2=' A été supprimée.'

; Language update 0.9b for ISXPM 2.0.0.0 beta 2
PATCH_TO='Patch to'
FOUNDED_VERSION='Détecté: '
VERSION_TO_PATCH='Préparation du patch: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Veuillez définir le répertoire de l'application!'

ALLREADY_UPDATED='L'application dans ce répertoire est la version actuelle (déjà mise à jour)!'
ROLLBACK_SUCCESS='Retour en arriere: '
INCLUDED_DIR_DELETED='Répertoire inclus: '
INCLUDED_DELETED_SUCCESS='Inclus: '
BACKUP_DIR_DELETED='Répertoire de sauvegarde: '
BACKUP_DIR_DELETED_NOT_FULLY='Répertoire de sauvegarde: '
TEMP_ROLLBACK_DELETED_IN_USE='Répertoire de restauration temporaire: '

; Language update 1.0 for ISXPM 2.0.0.0
EXTRACT_TO_TEMP='Extraction des données temporaires requises...'
EXTRACT_TO_TEMP2='Processus d'extraction, veuillez patienter...'
FOUNDED_VERSION_READY='Prêt à patcher!'
FILE_NOT_EXISTS='[!]  Le fichier requis pour le patch n'existe pas: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Impossible de trouver l'application dans le répertoire choisi!'
FOUNDED_VERSION2='Version valide détectée ! Prêt à patcher!'
VERIFICATION_UNSUCCESS='[!]  Certains fichiers n'existent pas ou ont un hachage incorrect!'
UNKNOWN_PATCHING_ERROR='[!]  Une erreur s'est produite lors de l'application des données de patch à: '

; Language update 1.1 for ISXPM 2.2.0.0
LOG_BTN_STATE='Log'

S_PATCHING='--> Fichier de correctif: '
S_COPYING='--> Copie de fichier: '
S_EXTRACTING='--> Fichier d'extraction: '
S_COPYING_EXTERNAL='--> Copie de fichier externe: '
S_ROLLBACK='--> Fichier de restauration: '
S_DELETING='--> Suppression de fichier: '
S_JUNKED_RESTORED='--> Fichier indésirable restauré: '
S_INVALID_FILE='[!]  Fichier non valide: '
S_VALID_FILE='OK! Fichier valide: '

; Language update 1.2 for ISXPM 2.3.0.0
VERSION_DETECTING='Détection de la version... Veuillez patienter...'

; Language update 1.2.1 for ISXPM 2.3.1.0
FILE_SKIPPED='[!]  Le fichier suivant n'existe pas et a été ignoré: '

; Language update 1.3 for ISXPM 2.4.0.0
GET_SPACE_FAILED='Pas assez d'espace libre sur '
REQUIRED_SPACE='Exiger: '
SPACE_GB='Gb!'
SPACE_MB='Mb!'
SPACE_ONLY='Il y a seulement '
SPACE_GB_FREE='Gb disponible en volume '
SPACE_MB_FREE='Mb disponible en volume '
SPACE_FREE_ONLY='Disponible '

;old corrected:
INSTALL_PATH_NOT_FOUND='Données requises introuvables dans le répertoire actuel ou mauvaise version!'
